Revit 2027 API
StructuralAsset.Behavior Property
 Flag indicating whether elements of this material behave isotropically or orthotropically.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralBehavior Behavior { get; set; }
Public Property Behavior As StructuralBehavior
	Get
	Set
public:
property StructuralBehavior Behavior {
	StructuralBehavior get ();
	void set (StructuralBehavior value);
}
member Behavior : StructuralBehavior with get, set
Property Value
StructuralBehavior
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 Applies to concrete, Metal, and generic structural assets. If the behavior is set to Isotropic, then the y and z components of Young modulus, Poisson modulus, shear modulus and thermal expansion coefficient will be changed to the value the same as their x components.
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace